# Задача 2. Вариант 6.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иисус Христос. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Dzhamiev D. R.
# 11.04.2016

print("Не судите, да не судимы будете.")

print("\n\t\t\t\t\tИ. Христос")

input("\n\nНажмите Enter для выхода.")
